package Tools

class Randoms {
    Random rnd = new Random()
    static def getRandomName()
    {
        Random rnd = new Random()

        String[] names = ["Александр","Алексей","Альберт","Анатолий","Антон","Артём","Афанасий","Богдан","Борис","Вадим","Валентин","Валерий","Василий","Виктор","Виталий",
                          "Владимир","Владислав","Всеволод","Вячеслав","Геннадий","Георгий","Герман","Григорий","Даниил","Денис","Дмитрий","Евгений","Егор","Захар","Иван",
                          "Игорь","Илья","Константин","Леонид","Максим","Никита","Николай","Олег","Родион","Роман","Дмитрий","Семён","Сергей","Тарас","Тимофей"]

        String name = names[rnd.nextInt(names.size())]
    }

    static def getRandomSurname()
    {
        Random rnd = new Random()

        String[] sunames = ["Иванов","Смирнов","Кузнецов","Попов","Васильев","Петров","Соколов","Михайлов","Новиков","Федоров","Морозов","Волков","Алексеев","Лебедев","Семенов",
                          "Егоров","Павлов","Козлов","Степанов","Николаев","Орлов","Андреев","Макаров","Никитин","Захаров","Зайцев","Соловьев","Борисов","Яковлев","Григорьев",
                          "Романов","Воробьев","Сергеев","Кузьмин","Фролов","Александров","Дмитриев","Королев","Гусев","Киселев","Ильин","Максимов","Поляков","Сорокин","Виноградов"]

        String suname = sunames[rnd.nextInt(sunames.size())]
    }

    static def getRandomSecondname()
    {
        Random rnd = new Random()

        String[] secondnames = ["Иванов","Смирнов","Попов","Васильев","Петров","Михайлов","Федоров","Алексеев","Семенов",
                            "Егоров","Павлов","Степанов","Николаев","Андреев","Макаров","Захаров","Борисов","Яковлев","Григорьев",
                            "Романов","Сергеев","Фролов","Александров","Дмитриев","Максимов"]

        String secondname = secondnames[rnd.nextInt(secondnames.size())]+"ич"
    }

    static def getRandomDay()
    {
        Random rnd = new Random()

        String day = (rnd.nextInt(28)+1)+""
    }

    static def getRandomMonth()
    {
        Random rnd = new Random()

        String month = (rnd.nextInt(12)+1)+""
    }

    static def getRandomYear()
    {
        Random rnd = new Random()

        String year = (rnd.nextInt(40)+1970)+""
    }


}
